In [1]:
import pandas as pd

df_twice = pd.DataFrame({
    'birth':[
        '1995-09-22','1996-11-01','1996-11-09','1996-12-29','1997-02-01','1997-03-24','1998-05-28','1999-04-23','1999-06-14'
    ],
    'height':[163,167,162,164,160,163,158,160,170],
    'weight':[48.6,49,49,45,47,46,49,47,49],
}, index=['나연','정연','모모','사나','지효','미나','다현','채영','쯔위'])

In [2]:
df_twice

         birth  height  weight
나연  1995-09-22     163    48.6
정연  1996-11-01     167    49.0
모모  1996-11-09     162    49.0
사나  1996-12-29     164    45.0
지효  1997-02-01     160    47.0
미나  1997-03-24     163    46.0
다현  1998-05-28     158    49.0
채영  1999-04-23     160    47.0
쯔위  1999-06-14     170    49.0

In [6]:
df_twice[df_twice['height'] >= 163]

         birth  height  weight
나연  1995-09-22     163    48.6
정연  1996-11-01     167    49.0
사나  1996-12-29     164    45.0
미나  1997-03-24     163    46.0
쯔위  1999-06-14     170    49.0

In [8]:
df_twice[df_twice['weight'] < 48]

         birth  height  weight
사나  1996-12-29     164    45.0
지효  1997-02-01     160    47.0
미나  1997-03-24     163    46.0
채영  1999-04-23     160    47.0

In [9]:
df_twice['height'].sort_values()

다현    158
지효    160
채영    160
모모    162
나연    163
미나    163
사나    164
정연    167
쯔위    170
Name: height, dtype: int64

In [10]:
df_twice['height'].sort_values(ascending=False)

쯔위    170
정연    167
사나    164
미나    163
나연    163
모모    162
채영    160
지효    160
다현    158
Name: height, dtype: int64

In [11]:
df_twice.sort_values(by='height')

         birth  height  weight
다현  1998-05-28     158    49.0
지효  1997-02-01     160    47.0
채영  1999-04-23     160    47.0
모모  1996-11-09     162    49.0
나연  1995-09-22     163    48.6
미나  1997-03-24     163    46.0
사나  1996-12-29     164    45.0
정연  1996-11-01     167    49.0
쯔위  1999-06-14     170    49.0

In [12]:
df_twice.sort_values(by='height',ascending=False)

         birth  height  weight
쯔위  1999-06-14     170    49.0
정연  1996-11-01     167    49.0
사나  1996-12-29     164    45.0
나연  1995-09-22     163    48.6
미나  1997-03-24     163    46.0
모모  1996-11-09     162    49.0
지효  1997-02-01     160    47.0
채영  1999-04-23     160    47.0
다현  1998-05-28     158    49.0

In [15]:
df_twice['height'].rank()

나연    5.5
정연    8.0
모모    4.0
사나    7.0
지효    2.5
미나    5.5
다현    1.0
채영    2.5
쯔위    9.0
Name: height, dtype: float64

In [16]:
df_twice['height'].rank(ascending=False)

나연    4.5
정연    2.0
모모    6.0
사나    3.0
지효    7.5
미나    4.5
다현    9.0
채영    7.5
쯔위    1.0
Name: height, dtype: float64